import React from "react";

const Blog = () => {
    return (
        <section className="container mx-auto pt-24">
            <h1 className="text-5xl mb-5">this is blog</h1>
            <div className="leading-relaxed">
                <p className="mb-3">
                    জাভাস্ক্রিপ্ট একটি স্ক্রিপ্টিং ল্যাঙ্গুয়েজ যেটা শুধুমাত্র Browser এই রান করা যায়। HTML ওয়েব পেজ কে ডাইনামিক রুপ দেওয়ার জন্য জাভাস্ক্রিপ্ট এর ভুমিকা অপরিসীম। যেহেতু জাভাস্ক্রিপ্ট ব্রাউজারে রান করে তাই এর সব থেকে বড় সুবিধা হল এটি সব
                    ধরণের অপারেটিং সিস্টেমে ব্যবহার করা যায়।
                </p>
                <p className="mb-3">
                    জাভাস্ক্রিপ্ট সম্পুর্ন ক্লাইন্ট সাইড ল্যাঙ্গুয়েজ অর্থাৎ কোন ইউজার যখন কোন ওয়েব পেজে জাভাস্ক্রিপ্ট রান করে তখন শুধুমাত্র সেই ব্রাউজারেই এটি এক্সিকিউট হয়ে যাবে। সার্ভারের সাথে জাভাস্ক্রিপ্ট এর কোন সরাসরি যোগাযোগ নাই, পেজ রিলোড
                    দেওয়ার সাথে সাথেই ডাটা নষ্ট হয়ে যাবে।
                </p>
                <p className="mb-3">
                    আর এই সমস্যার সমাধান করছে node js. নোড জেএস ব্যবহার করা হয় সার্ভার সাইট ডেভেলপমেন্ট এর জন্য। এটাকে জাভাস্ক্রিপ্ট এর Runtime ও বলা যেতে পারে। জাভাস্ক্রিপ্ট এর সমস্ত কোড আমরা Node Js এ লিখতে পারি তবে Node Js এ DOM নিয়ে কাজ করা যাবে
                    না। node js এ জাভাস্ক্রিপ্ট এর ফাংশন ছাড়াও আরও একাধিক function আছে। Node js এ ফাইল রিড, রাইট, আপডেট ও ডিলিট এর কাজ খুব সহজেই করা যায়।
                </p>
            </div>
        </section>
    );
};

export default Blog;
